<?php
/**
 * Created by PhpStorm.
 * User: Administrator
 * Date: 2017/6/20
 * Time: 9:35
 */
//马来西亚电话号码：0060(区号) 3-2143 2300
//$phone = '00 60 '.rand(1,9).'-'.rand(100,2500).' '.rand(1000,7000);
//印度电话号码：0091(区号) 11 2390 4472
//$phone = '00 91 '.'11'.'-'.rand(2000,4000).' '.rand(1000,5000);
//俄罗斯电话号码：007(区号) 812 334-35-40
//$phone = '00 7 '.rand(100,999).' '.rand(100,999).'-'.rand(10,99).'-'.rand(0,9).rand(0,9);
//新加坡电话号码：0065(区号) 6333 8388
//$phone = '00 65 '.rand(6000,6999).' '.rand(1000,8999);
//菲律宾电话号码：0063 2 795 0777
//$phone = '00 63 '.'2 '.rand(643,955).' '.rand(7000,8999);
//越南电话号码：0084(区号) 8 3823 6688
//$phone = '00 84 '.'8 '.rand(3823,6296).' '.rand(4466,7118);
//孟加拉国电话号码：00880(区号) 1978-616164
//$phone = '00 880 '.rand(1900,1978).'-'.rand(616000,616164);
//印度尼西亚电话号码：0062(区号) 370 6138444
//$phone = '00 62 '.'370 '.rand(6138000,6138444);
//新西兰电话号码：00 64 3-668 1394
//$phone = '00 64 '.'3-'.rand(600,668).' '.rand(1394,4648);
//尼泊尔人电话：00977 1-491688
//$phone = '00 977 '.'1-'.rand(491688,491800);
//泰国人电话号码：0066 2 659 9000
//$phone = '00 66 '.'2 '.rand(254,659).' '.rand(8880,9300);
//伊朗人电话号码：09121051850
//$phone = '091'.rand(21051850,22176035);
//荷兰人电话号码：0031 20 710 6090
//$phone = '00 31 '.'20 '.rand(622,710).' '.rand(6090,6352);
//墨西哥电话号码：0052 33 4164 2180
//$phone = '00 52 '.rand(33,55).' '.rand(4164,9177).' '.rand(2180,8400);
//缅甸人电话号码：00 95 1 229 860
//$phone = '00 95 '.rand(1,67).' '.rand(229,810).' '.rand(860,6088);
//波兰人电话号码：00 48 12 881 17 11
//$phone = '00 48 '.'12 '.rand(426,881).' '.rand(17,40).' '.rand(11,81);
//土耳其人电话号码：00 90 212 526 00 19
//$phone = '00 90 '.'212 '.rand(458,526).' '.rand(00,77).' '.rand(02,19);
//巴基斯坦人电话号码：0092 42 36310077
$phone = '00 92 '.rand(21,51).' '.rand(36310077,35663333);
echo $phone;
file_put_contents("data/Pakistani.txt",$phone.PHP_EOL,8);
echo "<script>window.location.reload();</script>";