<?php
/**
 * Created by PhpStorm.
 * User: linjiabei
 * Date: 2018/5/15
 * Time: 19:41
 */
$diff_book = array('都市极品神探','婚后试爱：高冷总裁宠鲜妻','萌婚甜宠：总裁蜜爱小辣妻','慕总裁的千金娇妻','罪后难宠','追心夺情：总裁猎爱捕逃妻','绿茵暴徒','极品女总裁的贴身狼兵','霸爱旖旎：荆棘恋','一夜婚情：前夫狠狠爱','豪门夜欲：罪爱娇妻','黑道之财色无双','娇柔千金爱上我','一夜贪欢：总裁的首席秘宠','桃运民工','医圣传人在都市','前夫，别来无恙','绝色女总裁的贴身保镖','契约婚姻：总裁前妻不要跑','超能兵王在都市','天才宝宝I：我帮妈咪钓男人','修仙之宠物美女','新锐天师','兽血沸腾在都市','豪门虐恋：逆爱','邪修丹皇','超能高手在花都','情陷总裁：叛妻的诱惑','将门虐恋：带球小妾斗将军','美人心计：倾世妖妃','情迷总裁：赖你一辈子','拽少爷的恋爱法则','高干子弟俏家女','神级召唤师','丑女夺夫记','龙霸乾坤','霸道总裁VS叛逃新娘','美男的诱惑','千娇百美图','女仆图录','总裁禁恋：霸上小后妈','邪神修仙','无赖药神','黑色豪门：首席的代罪甜心','无良奸商','误入敌营：腹黑王爷极品妃','聪明宝宝：誓死捍卫小妈咪','不良医生','将军王爷俏王妃','邪魅总裁，别叫我花痴','花都逍遥游','独战天下','豪门孽情：冷少的逃妻','疯狂透视眼','仇爱总裁：我要报复你','抵死缠绵：逃爱宠妃','异世星君','惹上狐仙校花','龙之位面','混迹神雕之龙女控','错恋小娇妻','黑道小姐通缉令','豪门大佬的上门甜心','我的问题少女们','皇后是猫妖','我的美女房东','弃妃当道','美女房东是妖精','朕的皇后是杀手','超级还原','流氓仙厨','浴血焚天','总裁，请别乱来','纨绔神医','都市猎妖记','总裁请自重','太子的诱惑','绝爱总裁遇到爱','重生之超级富豪','黑道特种兵','黑道枭雄','拜金女穿越：霸道情郎买回家','大罗金仙逍遥记','恋上黑帮大少','穿越之凤舞天下','婚前游戏：挑战撒旦总裁','老婆是明星：冷酷总裁明星妻','流氓丹皇','花都邪少','坏蛋是怎么泡妞的','腹黑王爷好诱惑','乌龙秘书要嫁人','杠上拽总裁的干物女','腹黑王爷的绝色弃妃','美女倒贴的保镖','退婚总裁杀手妻','少帅的替身情人','纨绔佛陀','特工官途','恶霸总裁：最好别爱我','债生缘：首席霸爱','指点江山笑拥美男','网游之暴力法师','很纯洁很暧昧','邪凛花都','风水大师混官场','都市之财色兼收','穿越之代妃出嫁','流氓修仙传','恶魔少爷，饶了我','花心王爷，不准太坏','粉嫩郡主闯天涯','异界魅影邪君','桃花宝鉴','剩女当嫁：八夫临门','都市邪神','九转金身','霸情冷少我不跑','温柔妻：老公，不要跟我玩暧昧','女生宿舍男楼管','家有美女兔仙','乖乖过来让我爱','奴妻','蛇后，乖乖让朕宠','花都魔少','官路鸿升','卿本惊华','邪魅总裁：你只配代孕','大小姐的贴身高手','黑道名媛','天降宝宝：邪魅总裁的诱惑','螳螂公子：黄雀孤女霸了身','玉女派掌门人','极品邪僧','女白领闯古代：圣君，要了我','女皇家的入赘小男人','豪门交易：黏上被拐新娘','花心太子，请从良吧','总裁，我包养你','撒旦危情：男人休要抢','凤斗苍穹：王爷，我废了你','流氓龙皇','傲世邪皇','村里那些事','午夜欢宠：圈恋娇美女郎','星界之王','无赖总裁，请别再骚扰我','冷艳校花：少爷，别这样','前世今生：吾家王妃是花魁','冷情帅将PK名门庶女','霸道痞子兵','腹黑总裁霸道妻','极乐逍遥医','逃妻不乖：爹地，快去追','都市花盗','双面少女：哥哥，别这样','暗帝，求包养！','帝宠：猫妃狠狠爱','美女贴身仙医','替身夫人','朕的皇后是猫妖','情乱豪门：总裁，放过我','与玉兔同居的日子','撩心擒爱：总裁，你被甩了','色上小胖妻','暴王，本宫要跳槽','致命诱惑：女人，你只是玩偶','弃妃不善：邪王走着瞧','红颜难耐：男装王妃不侍寝','蜜爱：甜心，惹人疼！','深夜孽欢：调教冰山名捕','权色禁区','锦绣洛神','从今到古：爷，你注定是我的','穿越乱江山：神偷皇后','邪凤逆天：替身宠妃不好惹','薄情总裁，饶了我','无良邪医','美女门诊部','携群美修仙','透视诱惑','超级美女军团','极品司机','贴身桃医','至尊冷王：爱妃别玩出火','官路之权色诱惑','傲娇总裁追娇妻','暧昧花都','暧昧同居','妇科小村医','美女派掌门人','美女总裁的贴身保镖','女神养成计划','蓝颜倾城：王妃是“断袖”','猎艳任务','铁血强宋','家有美娇妻','美女们的护花使者','闪婚厚爱：亿万首席宠甜妻','与女神合租的日子','将军，本“攻”包养你','我是你嫂子','我的眼睛能透视','校园纯情高手','豪门锁爱：我的男宠太放肆','红颜倾城：景瑜皇后传','桃运笔记','女捉妖师的神秘男宠','重生之左拥右抱','豪门仇爱：寡妇尤不得','王妃许三贪','英雄联盟之王者无双','英雄联盟之抢钱劫色','落魄千金遇上总裁先生','宠妻成婚','娇妃倾城','一品风华','女鬼萌萌哒：二货夫君碗里来','三生三世之神女传说','超级大亨','仙匠在异界','神偷娇妻：BOSS缴枪不杀','错嫁豪门，总裁别爱我','将爱情进行到底：总裁太恶毒','抱歉BOSS，睡错了','助理妈咪：总裁爹地，乖乖投降','暗黑婚约：总裁的复仇娇妻','都市财神传说','重生之龙战星宇','倾城丑妃','私婚秘宠：总裁就爱闹别扭','非你莫属：爱再相遇后','全能宗师的拽样人生','妖女重生复仇：御夫有道','代孕游戏，婚婚欲醉','重生之凤还巢','圣皇四少：圈养黑丫头','奉旨三嫁：悍妃不可挡','我的枕边有女鬼','英雄联盟之最强英雄','炼婴','我的嫂子是厂妹','最后一个驱鬼道士','钉坟匠','重生之贵女心计','囚爱童养媳：噬心前夫请止步','鬼名','英雄联盟之少年王者','烈火如歌：千金贵女','限时婚约：前夫请签字','极品百媚图','修仙归来在都市','我隔壁的女主播','九劫真仙','豪门隐婚：旧妻新爱','贴身透视眼','北美新秩序','守山匠','名门闺谋：嫡女二嫁弃夫','残王御宠：特工医妃','嫡女猖狂：麻辣世子妃','极品坏学生','王爷多情：冷宫医后要休夫','凶案现场','豪门缠婚：尤物小娇妻','强爱不婚：首席情深入骨','花手赌圣','狼性总裁：前妻不二嫁','情深缘浅：拒爱首席大人','我的绝色校花','我在都市造古董','豪门怨：亡妻归来','太阴黑莲经','超品小农民','霸少诱妻：纯禽老公悠着点','九域天尊','九阳劫帝','蜜爱甜宠：前夫复追小娇妻','修仙高手在校园','湘西诡闻录','通天武尊','狼族兵王','武破苍穹','如娇是妻：贪欢总裁不放手','诡灵公寓','绝世杀神','超级妖龙分身','种田高手在校园','豪门错爱：腹黑总裁捕逃妻','总裁霸爱：惹火纯妻','总裁约婚：枕上嫩妻','摸金秘记','特工穿越：霸道鬼王绝宠妃','013号凶案密档','致命医妃，嚣张二小姐','最后一个阴阳鬼医','弃女高嫁','名门盛爱：老公，请入局','一夜婚情：总裁的替身娇妻','凶残娇妻：总裁爱不完','惹火辣妻:总裁请当心','豪门暖婚：总裁独宠萌甜妻','苍天神帝','总裁夺情：霸宠甜妻抱入怀','甜妻高高在上','宠妃有道：战神王爷欺上榻','绯色豪门：首席旧爱轻点宠','弃妃倾城：腹黑王爷霸独宠','画皮匠','天庭朋友圈','豪门蜜爱：总裁的迷糊小娇妻','掳情掠爱：四少夜欢难消','追婚入室：男神总裁请带回','诱妻成瘾：司少，请止步','美女总裁的贴身兵王','我的绝色女盗','致命赌注','暖婚溺爱，厉少的盛世宠妻','筑天神帝','极品全才天王','我的青春正轻狂','修仙强者重回都市','宠夫上瘾：呆萌少爷易推倒','借婚试情：高冷首席宠上瘾','头条女王','一见钟情：夫人别想逃','遮天大主宰','暴力丹尊','嫡女傻妻：王爷请下榻','天外飞仙','桃运校园','轮回魔神','追婚总裁：尤物小妻请深爱','欲孽难恕：唇红玉体香','一见倾情：亿万首席宠甜妻','国术高手混花都','绝色美女的贴身兵王','万古杀神','诡案寻凶','一弦一顾付流年','乡野小春医','假婚真爱','星辰武帝','惹火豪门：总裁，别撩','全能小农民','豪门缠婚：男神总裁请签收','乡村小毒医','剃头匠','捡栋别墅当房东','情深未晚，总裁宠妻上瘾','苍灵大帝','弃妇翻身：总裁的二婚新娘','掌裂苍穹','超级小司机','丹武神尊','诱夫成瘾：陆少的无价妻','萌妻难逃：腹黑江少别过来','桃运风水师','桃运神相','彪悍女配：本宫不是白莲花','路过你的青春岁月','偷心皇妃：多情帝王宠娇客','萌妻鲜嫩：总裁大人轻点宠','凤魅天下：带着美团来穿越','重生娱乐圈之我欲为后','穿越乱世医女','婚爱缠绵：高冷总裁要不够','追妻成瘾：傲娇总裁你走开','通灵热线','嫡妃倾城：带个商城好穿越','器宗武神','豪门厚爱，冷情总裁你滚开！','万仙至尊','无上斗魂','宠婚为爱：鲜嫩甜妻送入怀','先婚后爱:总裁老公狂宠妻','重生之都市修仙高手','驭兽上尊','妖凡修仙传','蜜捕娇妻：厉少好手段','娇妻难撩：总裁大人强势宠','随身带着一亩地','仙界寻美专家','我的豪门老板娘','抗日之最强战兵','我的贴身女总裁','桃花鬼医','烈火麒麟','豪门夜妻：盛世二嫁','九婴邪仙','盗墓笔记之寻龙图','重生之娇妻太撩人','甜婚蜜宠','我的美女老婆','枕边娇妻：首席追爱锁入怀','旧爱新欢：总裁宠妻无度','女总裁的贴身小贩','神鼎天尊','相宝','倾心如故：火辣娇妻别想逃','豪门蜜爱：高冷总裁甜辣妻','美女娱记：撞爱霸道总裁','超级乡村兵王','宠妻100式：总裁很会撩','神医小农民','嗜心总裁：想说爱你不容易','蔷薇王子很诱惑','荆棘凤冠','悍妃八福晋','都市护花魔君','无限猎人','合租美女','独占契约：恶魔BOSS无下限','魔魂契约','我的狐仙姐姐','亡灵禁地1：美人香','最强神医','豪门枕上欢','少校多情：BOSS的重生冒牌妻','帝姬嫡女','漫漫婚情：薄少超给力','同居女房客','染指军婚，上校撩人','战王霸宠：刁蛮王妃要爬墙','修罗杀道','豪门盛婚：总裁，吻上瘾！');
//echo "<pre>";
//print_r($diff_book);
//echo "</pre>";
$exist_book = array('坏蛋是怎么泡妞的','美女们的护花使者','千娇百美图','乌龙秘书要嫁人','我的眼睛能透视','惹上狐仙校花','豪门孽情：冷少的逃妻','仙界寻美专家','邪凛花都','家有美女兔仙','新锐天师','修仙之宠物美女','流氓丹皇','女仆图录','午夜欢宠：圈恋娇美女郎','天才宝宝I：我帮妈咪钓男人','桃花宝鉴','极乐逍遥医','超级美女军团','大小姐的贴身高手','花都魔少','无良邪医','流氓仙厨','纨绔佛陀','很纯洁很暧昧','美女派掌门人','我的美女房东','高干子弟俏家女','暴王，本宫要跳槽','帝宠：猫妃狠狠爱','蜜爱：甜心，惹人疼！','仇爱总裁：我要报复你','黑色豪门：首席的代罪甜心','抵死缠绵：逃爱宠妃','穿越乱江山：神偷皇后','邪凤逆天：替身宠妃不好惹','花都逍遥游','恋上黑帮大少','不良医生','总裁，请别乱来','悍妃八福晋','美女房东是妖精','黑道小姐通缉令','霸道痞子兵','流氓修仙传','兽血沸腾在都市','拜金女穿越：霸道情郎买回家','粉嫩郡主闯天涯','错恋小娇妻','太子的诱惑','将门虐恋：带球小妾斗将军','傲世邪皇','霸道总裁VS叛逃新娘','总裁禁恋：霸上小后妈','无良奸商','奴妻','无赖总裁，请别再骚扰我','替身夫人','弃妃不善：邪王走着瞧','权色禁区','官路之权色诱惑','婚前游戏：挑战撒旦总裁','花都邪少','杠上拽总裁的干物女','美女倒贴的保镖','少帅的替身情人','特工官途','都市之财色兼收','恶霸总裁：最好别爱我','穿越之代妃出嫁','剩女当嫁：八夫临门','都市邪神','指点江山笑拥美男','女生宿舍男楼管','蛇后，乖乖让朕宠','邪神修仙','拽少爷的恋爱法则','冷艳校花：少爷，别这样','无赖药神','深夜孽欢：调教冰山名捕','从今到古：爷，你注定是我的','邪魅总裁，别叫我花痴','我的问题少女们','异界魅影邪君','女白领闯古代：圣君，要了我','撒旦危情：男人休要抢','凤斗苍穹：王爷，我废了你','村里那些事','冷情帅将PK名门庶女','腹黑总裁霸道妻','情陷总裁：叛妻的诱惑','都市花盗','携群美修仙','魔魂契约','美女总裁的贴身保镖','女神养成计划','家有美娇妻','超能高手在花都','美男的诱惑','穿越之凤舞天下','债生缘：首席霸爱','官路鸿升','前世今生：吾家王妃是花魁','情乱豪门：总裁，放过我','重生之左拥右抱');
echo "不同书籍的总数".count($diff_book);
echo "<hr>";
echo "在cp_book_info能找得到的书:".count($exist_book);

$exist_book1 = array();
$diff_book1 = array();
//将字符串左右两端的空格去掉
foreach($exist_book as $key=>$val) {
    array_push($exist_book1,trim($val));

}

foreach ($diff_book as $key1=>$val1) {
    array_push($diff_book1,trim($val1));
}
$result = array();

foreach ($diff_book1 as $k=>$v) {
    if(!in_array($v,$exist_book1)) {
        array_push($result,$v);
    }
}
echo "<hr>";
echo "在cp_book_info不能找到的书:".count($result);
echo "<pre>";
print_r($result);
echo "</pre>";
